## <font color=red>  Exercise \#2: Reading Dataset using Pandas </font>

## Total Points  : 50  
### <font color=Blue> Due: Tuesday 02/09/2021 11:59 PM </font>
#### Objective : Assess your ability to use Pandas Package to download, read and parse dataset into a dataframe

##### Skills needed:  In this homework assignment, you'll be using the concepts you've learned to
1. Edit and run  Jupyter notebooks
2. Write Python code using Pandas to :
    * import pandas package
    * identfy dataset file formats and column separators
    * Download and parse dataset using its url into pandas dataframe
    * replace missing values with nan
    * verify that the dataset is correctly parsed and loaded into dataframe
    * use read_csv correct parameters to parse dataset with missing header and irregular column separators

------
### <font color=darkorange> Type your name here:Mike Pendleton </font>

#

-----

## Requirements & Submission:
1. Use this notebook as a template for your answers. Then rename it as ` your first name`-`Last name-Ex2.ipynb`. 
2. Submit on WTClass __“Resources >> Tests, exercises and Quizzes >> Exercise\#2 __
3. Each task's answer must be given in the cells after the task description
4. Answers and explanations must be properly formatted in the appropriate Cell type
5. You can add as many cells as you needed
6. You should submit final ***clean version*** of your notebook, i.e. remove any experimenting cells

# Tasks: **<font color = purple> [50 points]</font> **


* For this homework you are required to use the auto-MPG dataset from UCI repository. The link to this data set is:

  https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data-original
 


- The file is "single / multi space" separated file i.e some columns are separated by single space and some are separated by multiple spaces.
- Also the dataset has no header, so be careful not to miss the first row of data.

### <font color=red> Download parse, and check the dataset:</font> **<font color = purple> [50 points]</font> **
   * a.**<font color = red> [20 points, 5 points for each subtask]</font> ** Use read_csv() function to read the dataset from Url above into pandas dataframe.
       * I.  Name the dataframe as `CarsData`, and use the correct parameters to parse the dataset. 
       * II. what is the missing value symbol in the dataset?
       * III.Replace the missing values in the `CarsData` dataframe by `Nan`
       * IV. use the correct parameters for correct parsing of the data. 
              -Note: In addition to columns separators, this dataset does not have column names (header), so use the correct `read_csv` parameters to read the dataset (to avoid missing the 1st row of data)
       
   * b.**<font color = red> [20 points, 4 points for each subtask]</font> ** To verify your data were parssed and loaded correctly,  Write Python commands to check and verify each the follwoing:
       * i- The number of rows and columns in the dataframe
       * ii- The default column labels of the dataframe
       * iii- The 1st 6 rows of the dataframe
       * iV- The last 6 rows of the dataframe
       * V- Any set of rows that has missing value(s) to make sure missing values were replaced by Nan 
       
   * c.**<font color = red> [10 points]</font> ** Write Python commands to assign correct column (attribute) names to the dataframe. You need to Get the column names from the data description that comes with the dataset. Use the Link below to download data description text file. 
     * https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.names

## <font color=Green> Task Answers: </font>

Step 0:

In [3]:
import pandas as pd
import numpy as np

**a) <font color=green> Use read_csv() function to read the dataset from Url above into pandas dataframe. </font> **

*  <font color=green> What was the missing value symbol in the dataset? </font>

* The symbol was : none, I saw this and thought it was odd so after researhing I was expecting it to be an actual symbol like ?. This is clearly stated "however, the Python None will arise and we wish to also consider that “missing” or “not available” or “NA”." I found this from the source 'https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html'

Use the approperiate `read_csv` parameters, and use `CarsData` as the dataframe variable

In [4]:
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data-original"
CarsData = pd.read_csv(url ,header=None, delim_whitespace=True,
                       usecols=lambda x: 'UnNamed' not in url)

CarsData[:11]

,0,1,2,3,4,5,6,7,8
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
5,15.0,8.0,429.0,198.0,4341.0,10.0,70.0,1.0,ford galaxie 500
6,14.0,8.0,454.0,220.0,4354.0,9.0,70.0,1.0,chevrolet impala
7,14.0,8.0,440.0,215.0,4312.0,8.5,70.0,1.0,plymouth fury iii
8,14.0,8.0,455.0,225.0,4425.0,10.0,70.0,1.0,pontiac catalina
9,15.0,8.0,390.0,190.0,3850.0,8.5,70.0,1.0,amc ambassador dpl
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas

** b) <font color=green> verify your data were parssed and loaded correctly </font> **

* i- The number of rows and columns in the dataframe

In [34]:
CarsData.shape

(406, 9)

* ii- The default column labels of the dataframe

In [9]:
#CarsData.columns

CarsData.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

* iii- The 1st 6 rows of the dataframe

In [12]:
#CarsData[:6]
index = CarsData.index
columns = CarsData.columns
values = CarsData.values

CarsData[:6]

      0    1      2      3       4     5     6    7                          8
0  18.0  8.0  307.0  130.0  3504.0  12.0  70.0  1.0  chevrolet chevelle malibu
1  15.0  8.0  350.0  165.0  3693.0  11.5  70.0  1.0          buick skylark 320
2  18.0  8.0  318.0  150.0  3436.0  11.0  70.0  1.0         plymouth satellite
3  16.0  8.0  304.0  150.0  3433.0  12.0  70.0  1.0              amc rebel sst
4  17.0  8.0  302.0  140.0  3449.0  10.5  70.0  1.0                ford torino
5  15.0  8.0  429.0  198.0  4341.0  10.0  70.0  1.0           ford galaxie 500

* iV- The last 6 rows of the dataframe

In [13]:
#CarsData[:-6]

CarsData[-6:]

        0    1      2     3       4     5     6    7                 8
400  27.0  4.0  151.0  90.0  2950.0  17.3  82.0  1.0  chevrolet camaro
401  27.0  4.0  140.0  86.0  2790.0  15.6  82.0  1.0   ford mustang gl
402  44.0  4.0   97.0  52.0  2130.0  24.6  82.0  2.0         vw pickup
403  32.0  4.0  135.0  84.0  2295.0  11.6  82.0  1.0     dodge rampage
404  28.0  4.0  120.0  79.0  2625.0  18.6  82.0  1.0       ford ranger
405  31.0  4.0  119.0  82.0  2720.0  19.4  82.0  1.0        chevy s-10

* V- Any set of rows that has missing value(s) to make sure missing values were replaced by Nan

In [21]:
#mvs = ['?','NA','--','n/a']

#CarsData = pd.read_csv(url ,header=None, delim_whitespace=True,
                       #usecols=lambda x: 'UnNamed' not in url,na_values=mvs)


#is_NaN = CarsData.isnull()
#row_has_NaN = is_NaN.any(axis=1)
#rows_with_NaN = CarsData[row_has_NaN]

#rows_with_NaN
A =[2, 33, 22, 14, 25]
A[-1]

25

**c) <font color=green> assign correct column (attribute) names to the dataframe </font> **

In [45]:
CarsData.columns = ["mpg:", "cylinders:", "displacement:", "horsepower:","weight:","acceleration:","model year:"
                    ,"origin:","car name:"]
CarsData[:5]

,mpg:,cylinders:,displacement:,horsepower:,weight:,acceleration:,model year:,origin:,car name:
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino